1.分析以下需求，并用代码实现：
	(1)定义一个存放手机号码的数字字符串数组{"16210626656","18601066888","13912387666","13156166693","15115888028"}
	(2)利用正则表达式过滤出符合条件的手机号码，
		规则：第1位是1，第二位可以是数字358其中之一，后面6位任意数字，最后3位为任意相同的数字。
	(3)如：18601066888 13912387666

2.正则表达式练习(只要求写出正则表达式)
	(1)邮箱
	(2)手机号
	(3)qq号(5-15位数字、0不能开头、必须都是数字)
	(4)叠词(快快乐乐,高高兴兴)
	(5)叠词(死啦死啦,高兴高兴)
	(6)密码(以字母开头，长度在6-18之间,只能包含数字、字母和下划线)
	
3.分析以下需求，并用代码实现：
	(1)通过键盘录入日期字符串，格式(2015-10-20)
	(2)输出该日期是星期几及这一年的第几天
	(3)如输入：2015-10-20，输出"2015年-10月-20日 是 星期二，是  2015年的第 293 天"
	
4.练习今天课堂代码
	

	
