1.分析以下需求，并用代码实现：
	(1)打印1到100之内的整数，但数字中包含9的要跳过
	(2)每行输出5个满足条件的数，之间用空格分隔
	(3)如：1 2 3 4 5 

2.分析以下需求，并用代码实现：
	(1)按照从大到小的顺序输出四位数中的个位+百位=十位+千位(3553,2332,1166,8228,3773)的数字及个数
	(2)每行输出5个满足条件的数，之间用空格分隔
	(3)如：9999 9988 9977 9966 9955 	

3.分析以下需求，并用代码实现：
	(1)珠穆朗玛峰高度为8848米，有一张足够大的纸，厚度为0.001米。
	(2)请问，我折叠多少次，可以折成珠穆朗玛峰的高度。
	
4.分析以下需求，并用代码实现：
	(1)倒着打印九九乘法表
	
5.分析以下需求，并用代码实现：
	(1) 计算15+25+35+....+1005的和
	
6.分析以下需求，并用代码实现：
	(1)打印倒直角三角形
		*****
		****
		***
		**
		*

7.分析以下需求，并用代码实现(每个小需求都要封装成一个方法)：
	(1)求两个数据之和(两个整数或者两个小数)
	(2)判断两个数据是否相等(两个整数或者两个小数)
	(3)获取两个数中较大的值(两个整数或者两个小数)
	(4)打印m行n列的星形矩形
	(5)打印nn乘法表

8.把今天讲过的其他案例再练习一遍