package cn.itcast.day05.demo01;

/*
 * 什么是方法？方法就好像是一个工厂。
 * 蒙牛工厂
 * 		原料：奶牛、饲料
 * 		产出物：牛奶、各种奶制品
 * 钢铁工厂
 * 		原料：铁矿石、煤炭
 * 		产出物：各种钢铁建材
 * 程序当中的方法
 * 		参数（原料）：进入方法的数据
 * 		返回值（产出物）：从方法中出来的数据
 * 
 * 如何定义一个方法？格式：
 * 修饰符 返回值类型 方法名称(参数类型 参数名称) {
 * 		方法体
 * 		return 返回值;
 * }
 * 
 * 解释：
 * 修饰符：目前的固定写法，两个关键字，public static
 * 返回值类型：方法最终产生的数据是什么类型
 * 方法名称：自定义的名字，规则和变量一样
 * 参数类型：进入方法的数据是什么类型
 * 参数名称：进入方法的数据，对应的变量名称
 * 方法体：需要执行的若干行代码
 * return：有两个作用，第一结束当前方法，第二带着后面的返回值交给调用处
 * 返回值：方法的最终数据结果
 * 
 * 注意事项：
 * 1. 返回值类型必须和返回值对应。
 * 2. 如果参数有多个，那么使用逗号进行分隔。
 * 3. 如果不需要参数，那么小括号可以留空。
 */
public class Demo01MethodDefine {

}
