1.使用三元运算符完成如下练习(以int类型数据为例,数字要求键盘录入)
	(1)比较两个数是否相等
	(2)获取两个数中最小值
	(3)获取三个数中最小值(考虑能否用一条三元运算符实现)	

2.看程序写结果：请自己独立分析，先不要编译运行。
	第一题
		int x = 1,y = 1;

		if(x++==2 & ++y==2)
		{
			x =7;
		}
		System.out.println("x="+x+",y="+y);  

---------------------------------------------------

	第二题
		int x = 1,y = 1;

		if(x++==2 && ++y==2)
		{
			x =7;
		}
		System.out.println("x="+x+",y="+y);

---------------------------------------------------
	第三题
		boolean b = true;

		if(b==false) 
			System.out.println("a");
		else if(b)
			System.out.println("b");
		else if(!b)
			System.out.println("c");
		else
			System.out.println("d");

---------------------------------------------------

3.分析以下需求，并用代码实现：
	(1)键盘录入一个整数给变量x，输出对应的变量y的值
	(2)x值和y值的对应关系如下：
		x<0 y=-1
		x=0 y=0
		x>0 y=1
	(3)如果用户输入的x的值为2，程序运行后打印格式"x=2,y=1"

4.分析以下需求，并用代码实现：
	(1)根据工龄(整数)给员工涨工资(整数),工龄和基本工资通过键盘录入
	(2)涨工资的条件如下：
		[10-15)     +5000
		[5-10)      +2500
		[3~5)       +1000
		[1~3)       +500
		[0~1)       +200
	(3)如果用户输入的工龄为10，基本工资为3000，程序运行后打印格式"您目前工作了10年，基本工资为 3000元, 应涨工资 5000元,涨后工资 8000元"

5.看程序，分析下面程序的结果：
	int x = 2,y=3;

	switch(x)
	{
		default:
			y++;
		case 3:
			y++;
			break;
		case 4:
			y++;
	}

	System.out.println("y="+y);
		
6.把今天讲过的其他案例再练习一遍