1、代码块是什么，分为哪几类，各自有什么特点？

2、子父类都有静态代码块、构造代码块、构造方法，那么他们六者之间的执行流程是什么？

3、继承的好处、弊端分别是什么？

4、Java中继承的特点是什么？

5、Java中继承的注意事项是什么？我们什么时候使用继承?

6、this关键字和super关键字分别代表什么，以及他们各自的作用分别是什么？

8、继承中构造方法的执行流程是什么？

9、为什么子类中所有的构造方法默认都会访问父类的空参构造？
   假如父类没有无参构造方法，子类应该怎么办?

10、super关键字和this关键字可以在构造方法中共存吗？

	
11、Overload和Override的区别是什么？方法重载能改变返回值类型吗？
	
12、final关键字可以做什么,有什么特点?

13、final修饰局部变量时，有什么特点？

14、根据需求，完成如下代码（按照标准格式写），并在测试类中进行测试。
	需求一：
		项目经理类 
			属性：姓名 工号 工资 奖金
			行为：工作work
		程序员类
			属性：姓名 工号 工资
			行为：工作work
	需求二：
		已知学生类和老师类如下：
			属性:姓名,年龄
			行为:吃饭
			老师有特有的方法:讲课
			学生有特有的方法:学习
	需求三：
		已知猫类和狗类：
			属性:毛的颜色,腿的个数
			行为:吃饭
			猫特有行为:抓老鼠catchMouse
			狗特有行为:看家lookHome