1：计算出十进制46对应的二进制，八进制，十六进制的值。
至于进制的内容今天在练习一次，以后就可以不用练习了。
后面能听懂就OK了。不用浪费太多时间。
(可用计算器验证你算的是否正确)

2：什么是变量?变量的定义格式?要使用变量需要注意什么?

3：Java中的数据类型分几类?基本数据类型有哪些?

4：数据类型转换：
	隐式转换：
	强制转换：


	面试题：
		第一题：
		byte b1=3,b2=4,b;
		b=b1+b2;
		b=3+4;
		哪句是编译失败的呢？为什么呢？

		第二题：
		byte  by = 130;有没有问题?有问题如何解决?结果是多少呢?

		第三题:
		byte b = 10;
		b++;
		b = b + 1;
		哪句是编译失败的呢？为什么呢？
5:常见的算术运算符有哪些?
  +运算符的作用有哪些?
  答:正号,字符串连接符号,算术运算符
  除法和取余的区别?
  ++和--的使用规则?

6:常见的赋值运算符有哪些?
  +=运算的作用是什么?
  扩展的赋值运算符有什么特点?

7：short s = 1; s = s + 1;有没有问题?如果有怎么解决?
   short s = 1; s += 1;有没有问题?如果有怎么解决?
	
8:常见的关系运算符有哪些?
  关系运算符的结果有什么特点?
9：练习打字(每天十分钟,即使休息的时候，也建议练习)